stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio_timer.c
/**
  ******************************************************************************
  * @file    stm32wb0x_hal_radio_timer.c
  * @author  GPM WBL Application Team
  * @brief   Virtual timer and Radio timer high level APIs
  * @details This file implements the software layer that provides the virtualization of the
  * resources of a single hardware timer in order to allocate many user virtual timers.
  * The only constraint to the number of virtual timers is the memory.
  * Each instance of a virtual timer is placed in an queue ordered by the expiration time
  * and it can be linked to a callback.
  * The timer tick is in charge to execute the callback linked to each virtual timer
  * and to update the hardware timeout to guarantee the expiration of the next virtual
  * timer in the queue.
  * A special virtual timer called calibration/anti-wrapping timer is automatically armed
  * by the software. This timer can address two tasks:
  * - it is in charge to maintain the never wrapping virtual time base.
  * - if the slow clock calibration is enabled, it starts the calibration procedure at each
  * calibration interval specified during the initialization.
  *
  * A timer is intended as an event programmed in the future at a certain absolute expiration time
  * on a time base. In this implementation the time base grows on 64 bits. Then, it never wraps.
  * However, due to hardware timer finite length and in order to maintain the timing coherency, the time base
  * must be maintained at least one time before the hardware timer wraps.
  * Then even if the slow clock calibration is disabled, the calibration/anti-wrapping timer
  * is always active with the only role to maintain the time base and it will expire
  * at a rate that depends on the hardware timer capability.
  * The time base unit is a STU that is the unit exposed to the user and it is equal to 625/256 us.
  * The calibration/anti-wrapping mechanism is not managed by the user.
  *
  * This software layer also exposes the possibility to program a radio timer.
  * A radio timer allows the user to trigger an already configured radio transaction.
  * The duties of this library does not include the configuration of a radio transaction.
  * This layer tries to exploit the last calibration values to program the radio activity
  * in order to improve the accuracy. In this case, the radio event is not immediately programmed
  * when it is requested, but only when the next calibration values are available.
  * Since the calibration values are available inside the timer tick when the calibration is over,
  * the application must ensure that the timer tick is called after the calibration timer
  * expiration within a certain margin in order to avoid that the radio event is shifted in the
  * past and cannot be anymore programmed.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x_hal.h"
/** @addtogroup STM32WB0x_HAL_Driver
  * @{
  */
#ifdef HAL_RADIO_TIMER_MODULE_ENABLED
/** @addtogroup RADIO_TIMER
  * @brief HAL RADIO TIMER  module driver
  * @{
  */

/* Private typedef -----------------------------------------------------------*/

/** @defgroup RADIO_TIMER_Private_Types RADIO TIMER Private Types
  * @{
  */
typedef struct
{
  uint8_t periodicCalibration; /*!< Periodic calibration enable status */
  uint32_t periodicCalibrationInterval;  /*!< Periodic calibration interval in ms, to disable set to 0 */
  uint32_t periodicCalibrationCheckDuration;  /*!< Interval between calibration start and timeout interrupt to check if calibration is completed */
  bool calibration_in_progress;  /*!< Flag to indicate that a periodic calibration has been started */
} CalibrationSettingsTypeDef;

typedef struct
{
  uint32_t period;        /** Number of 16 MHz clock cycles in (2*(SLOW_COUNT+1)) low speed oscillator periods */
  uint32_t freq;          /** 2^39/period */
  int32_t freq1;          /** Round(((freq/64)*0x753)/256) */
  int32_t period1;        /** Round (( ((period /256) * 0x8BCF6) + (((period % 256)* 0x8BCF6)/256)) / 32) */
  int32_t last_period1;   /** Period global in last calibration */
  uint64_t last_calibration_time; /** Absolute system time when last calibration was performed */
  uint32_t calibration_machine_interval; /** Calibration Interval MTU */
  uint8_t calibration_data_available; /** Flag to signal if a new calibration data is available or not */
} CalibrationDataTypeDef;

typedef struct
{
  uint8_t tx_cal_delay; /**time in MTU to be compensated if transmission and pll calibration are requested. The value in RAM must be initialized before the TIMER is initialized*/
  uint8_t tx_no_cal_delay; /**time in MTU to be compensated if transmission is requested. The value in RAM must be initialized before the TIMER is initialized*/
  uint8_t rx_cal_delay; /**time in MTU to be compensated if reception and pll calibration are requested. The value in RAM must be initialized before the TIMER is initialized*/
  uint8_t rx_no_cal_delay; /**time in MTU to be compensated if reception is requested. The value in RAM must be initialized before the TIMER is initialized*/
  uint8_t tx_cal_delay_st; /**time in STU to be compensated if transmission and pll calibration are requested. The value in RAM must be initialized before the TIMER is initialized*/
  uint8_t tim12_delay_mt;
} TxRxDelayTypeDef;

typedef struct
{
  uint64_t expiryTime;
  bool cal_req;
  bool active;
  bool pending;
  bool intTxRx_to_be_served;
  bool event_type;
} RADIO_TIMER_RadioHandleTypeDef;

typedef struct
{
  CalibrationSettingsTypeDef calibrationSettings;
  CalibrationDataTypeDef calibrationData;
  TxRxDelayTypeDef TxRxDelay;
  VTIMER_HandleType calibrationTimer;
  RADIO_TIMER_RadioHandleTypeDef radioTimer;
  uint32_t hs_startup_time; /*!< HS startup time */
  uint64_t cumulative_time; /** Absolute system time since power up */
  uint64_t last_system_time; /** Last System Time */
  uint32_t last_machine_time; /** Last machine time used to update cumulative time */
  uint8_t last_setup_time; /**setup time of last timer programmed*/
  uint32_t last_anchor_mt;
  VTIMER_HandleType *rootNode; /*!< First timer of the host timer queue */
  bool enableTimeBase;      /*!< Internal flag. User can ignore it*/
  uint8_t expired_count; /*!< Progressive number to indicate expired timers */
  uint8_t served_count; /*!< Progressive number to indicate served expired timers */
  uint8_t stop_notimer_action; /*!< Flag to indicate DEEPSTOP no timer action */
  uint8_t wakeup_calibration; /*!< Flag to indicate if start a calibration after  wakeup */
#if defined (STM32WB06) || defined (STM32WB07)
  uint8_t hostIsRadioPending; /*!< If hostIsRadioPending is true, the virtual timer callback will be triggered when the wakeup timer triggers */
  uint32_t hostMargin; /*!< It depends on the hs startup time. See HOST_MARGIN */
  uint8_t waitCal; /*!< Wait the next calibration to get the latest values */
#endif
} RADIO_TIMER_ContextTypeDef;

/**
  * @}
  */

