stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio_timer.c
/* Private define ------------------------------------------------------------*/
/** @defgroup RADIO_TIMER_Private_Defines RADIO TIMER Private Defines
  * @{
  */
#define MULT64_THR_FREQ (806)
#define MULT64_THR_PERIOD (1589)

/* Margin to add to the calibration interval in order to guarantee
 * enough time to program the radio timer after the calibration.
 * It is expressed in STU. */
#define RADIO_ACTIVITY_MARGIN (204800)

/* Time after that calibration should be completed
 * It is expressed in STU.*/

#define CALIBRATION_CHECK_DURATION (100)

/* Threshold to take into account the calibration duration. */

#define CALIB_SAFE_THR (370)

/* Minimum threshold to safely program the radio timer (expressed in STU) */
#define TIMER1_MARGIN (10)

/*  Delay to program a radio timer in the worst case (in STU).
   This is the sum of: 1st init dalay, 2 init delay and tx delay (118 + 65 + 2)  */
#define TIMER1_INIT_DELAY (76)

/* Radio event types */
#define RX (0)
#define TX (1)

#define MARGIN_EXT (200)

/* Minimum threshold in STU to safely clear radio timers.
The wakeup timer in the worst case triggers about 30us in advance.
This must be considered when the radio timer is cleared.
Then a window of about 30 us is considered as critical, that is
it is not sure the timer can be cleared properly */
#define CLEAR_MIN_THR (15)

/* Extra margin to consider before going in low power mode.
   This is the time (STU) needed for the system to go to sleep from the time the
   HAL_RADIO_TIMER_PowerSaveLevelCheck() is called. */
#define LOW_POWER_THR (82)  // Around 200 us.

#if defined (STM32WB06) || defined (STM32WB07)
/* HOST_MARGIN is the margin in STU needed to program a pending radio operation after the host timer is triggered */
#define HOST_MARGIN (200)

#define RADIO_TX_RX_EXCEPTION_NUMBER 18
#endif

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/** @defgroup RADIO_TIMER_Private_Macros RADIO TIMER Private Macros
  * @{
  */

#define ATOMIC_SECTION_BEGIN() uint32_t uwPRIMASK_Bit = __get_PRIMASK(); \
  __disable_irq(); \
  /* Must be called in the same scope of ATOMIC_SECTION_BEGIN */
#define ATOMIC_SECTION_END() __set_PRIMASK(uwPRIMASK_Bit)

#define MAX(a,b) ((a) < (b) )? (b) : (a)
#define MIN(a,b) ((a) < (b) )? (a) : (b)
#define DIFF8(a,b) ((a)>=(b) ? ((a)-(b)) : (256+((a)-(b))))
#define TIME_DIFF(a, b)       (((int32_t)((a - b) << (32-TIMER_BITS))) >> (32-TIMER_BITS))
/* This define assumes that a is always greater than b */
#define TIME_ABSDIFF(a, b)       ((a - b) & TIMER_MAX_VALUE)
#define INCREMENT_EXPIRE_COUNT_ISR (RADIO_TIMER_Context.expired_count\
                                    = ((RADIO_TIMER_Context.expired_count + 1) == RADIO_TIMER_Context.served_count) ? RADIO_TIMER_Context.expired_count : (RADIO_TIMER_Context.expired_count + 1))
#define INCREMENT_EXPIRE_COUNT ATOMIC_SECTION_BEGIN(); INCREMENT_EXPIRE_COUNT_ISR ; ATOMIC_SECTION_END();

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup RADIO_TIMER_Private_Variables RADIO TIMER Private Variables
  * @{
  */
static RADIO_TIMER_ContextTypeDef RADIO_TIMER_Context;
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RADIO_TIMER_Private_Constants  RADIO TIMER Private Constants
  * @{
  */
#define TIMER_SYSTICK_PER_FIVE_SECONDS (2048000)
#define TIMER_SYSTICK_PER_SECOND       (409600)
#define TIMER_SYSTICK_PER_10MS         (4096)

/** Margin arging to take for long sleep to allow the
  * system to avoid to have the counter wrapping. It is expressed in machine
  * time, so it is variable when using internal RO
  */
#define TIMER_WRAPPING_MARGIN (4096)
/** Number of significant bits in the radio timer */
#define TIMER_BITS (32)
#define TIMER_MAX_VALUE (0xFFFFFFFFU >> (32-TIMER_BITS))

#define WAKEUP_INIT_DELAY (27) /* about 65us in STU */
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @addtogroup RADIO_TIMER_Private_Functions
  * @{
  */
/* Privati Calibration APIs */
static void _calibrationProcedure(void);
static void _timer_start_calibration(void);
static void _timer_calibrate(CalibrationDataTypeDef *calibrationData);
static void _get_calibration_data(CalibrationDataTypeDef *calibrationData);
static void _calibration_callback(void *handle);
static void _updateCalibrationData(void);

static uint32_t _us_to_systime(uint32_t time);
static uint32_t _us_to_machinetime(uint32_t time);
static void _configureTxRxDelay(RADIO_TIMER_ContextTypeDef *context, uint8_t calculate_st);
static void _update_xtal_startup_time(uint16_t hs_startup_time, int32_t freq1);
uint32_t blue_unit_conversion(uint32_t time, uint32_t period_freq,
                              uint32_t thr); /* Translate MTU to STU and vice-versa. It is implemented using integer operation. */
static uint64_t _get_system_time_and_machine(RADIO_TIMER_ContextTypeDef *context, uint32_t *current_machine_time);
static int32_t _start_timer(VTIMER_HandleType *timerHandle, uint64_t time);
static VTIMER_HandleType *_update_user_timeout(VTIMER_HandleType *rootNode, uint8_t *expired);
static VTIMER_HandleType *_insert_timer_in_queue(VTIMER_HandleType *rootNode, VTIMER_HandleType *handle);
static void _virtualTimeBaseEnable(FunctionalState state);
static VTIMER_HandleType *_remove_timer_in_queue(VTIMER_HandleType *rootNode, VTIMER_HandleType *handle);
static VTIMER_HandleType *_check_callbacks(VTIMER_HandleType *rootNode, VTIMER_HandleType **expiredList);
static void _update_system_time(RADIO_TIMER_ContextTypeDef *context);
static void _check_radio_activity(RADIO_TIMER_RadioHandleTypeDef *timerHandle, uint8_t *expired);
#if defined (STM32WB06) || defined (STM32WB07)
static uint32_t TIMER_SetRadioHostWakeupTime(uint32_t delay, bool *share);
static void _set_controller_as_host(void);
static void _check_host_activity(void);
#else
static uint32_t VTIMER_SetWakeupTime(uint32_t delay, bool allow_sleep);
#endif
static uint8_t TIMER_SetRadioTimerValue(uint32_t timeout, bool event_type, bool cal_req);
static uint64_t TIMER_GetPastSysTime(uint32_t time, uint64_t *current_system_time);
static bool TIMER_SleepCheck(void);
static uint8_t TIMER_GetRadioTimerValue(uint32_t *time);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup RADIO_TIMER_Exported_Functions Radio Timer Exported Functions
  * @{
  */

/* ------------------------ RADIO Init APIs ----------------------------------*/
/**
  * @brief  Initialize the radio timer module. It must be placed in the initialization
  *         section of the application.
  * @param RADIO_TIMER_InitStruct Radio Timer Initialization parameters
  * @retval None
  */
void HAL_RADIO_TIMER_Init(RADIO_TIMER_InitTypeDef *RADIO_TIMER_InitStruct)
{
  /* Interrupt Configuration */
  LL_RADIO_TIMER_ClearFlag_CPUWakeup(WAKEUP);
  LL_RADIO_TIMER_EnableCPUWakeupIT(WAKEUP);
  NVIC_EnableIRQ(RADIO_TIMER_CPU_WKUP_IRQn);
  NVIC_EnableIRQ(RADIO_TIMER_ERROR_IRQn);

