stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio_timer.c
#if defined (STM32WB06) || defined (STM32WB07)
      if (RADIO_TIMER_Context.waitCal)
      {
        RADIO_TIMER_Context.waitCal = 0;
        RADIO_TIMER_Context.radioTimer.pending = TRUE;
        _check_radio_activity(&RADIO_TIMER_Context.radioTimer, &expired);
        RADIO_TIMER_Context.rootNode = _update_user_timeout(RADIO_TIMER_Context.rootNode, &expired);
        if (expired == 1)
        {
          /* A new root timer is already expired, mimic timer expire */
          INCREMENT_EXPIRE_COUNT;
        }
      }
#else
      _check_radio_activity(&RADIO_TIMER_Context.radioTimer, &expired); //Start Radio Timer after calibration
#endif

      /* Schedule next calibration event */
      HAL_RADIO_TIMER_StopVirtualTimer(&RADIO_TIMER_Context.calibrationTimer);
      _start_timer(&RADIO_TIMER_Context.calibrationTimer,
                   HAL_RADIO_TIMER_GetCurrentSysTime() + RADIO_TIMER_Context.calibrationSettings.periodicCalibrationInterval);
    }
  }
  /* if there is a periodic calibration, start it in advance during the active phase */
  else
  {
    if (RADIO_TIMER_Context.calibrationSettings.periodicCalibration)
    {
      if (HAL_RADIO_TIMER_GetCurrentSysTime() > (RADIO_TIMER_Context.calibrationData.last_calibration_time +
                                                 TIMER_SYSTICK_PER_FIVE_SECONDS))
      {
        HAL_RADIO_TIMER_StopVirtualTimer(&RADIO_TIMER_Context.calibrationTimer);
        _calibration_callback(&RADIO_TIMER_Context.calibrationTimer);
      }
    }
  }
}

/**
  * @brief  Return the status of the radio timer.
  *         The timeout of the last radio timer activity taken into account by the Timer Module
  *         is saved in the variable passed as parameter.
  * @param  time: Pointer of the variable where the time of the last radio activity scheduled is stored
  *               The time is expressed in STU.
  * @retval 0 if no radio timer is pending.
  * @retval 1 if a radio timer is pending.
  */
RADIO_TIMER_Status HAL_RADIO_TIMER_GetRadioTimerStatus(uint64_t *time)
{
  RADIO_TIMER_Status status;

  *time = RADIO_TIMER_Context.radioTimer.expiryTime;
  if ((RADIO_TIMER_Context.radioTimer.pending) || (LL_RADIO_TIMER_IsEnabledBLEWakeupTimer(WAKEUP))
      || (LL_RADIO_TIMER_IsEnabledTimer1(BLUE)))
  {
    status =  RADIO_TIMER_PENDING;
  }
  else
  {
    status = RADIO_TIMER_OFF;
  }
  return status;
}

/**
  * @brief Get the last anchorPoint in system time unit.
  * @param current_system_time: Current System Time
  * @return TimerCapture register in system time unit.
  */
uint64_t HAL_RADIO_TIMER_GetAnchorPoint(uint64_t *current_system_time)
{
  return TIMER_GetPastSysTime(BLUE->TIMERCAPTUREREG, current_system_time);
}

/**
  * @brief  Returns the admitted low power mode according to the next timer activity.
  * @return Low Power mode
  */
PowerSaveLevels HAL_RADIO_TIMER_PowerSaveLevelCheck(void)
{
  uint32_t nextRadioActivity;
  uint8_t timerState;
  uint64_t current_time;
  PowerSaveLevels level;

  if (TIMER_SleepCheck() == FALSE)
  {
    return POWER_SAVE_LEVEL_RUNNING;
  }

  level = POWER_SAVE_LEVEL_STOP;

  current_time = HAL_RADIO_TIMER_GetCurrentSysTime();
  timerState = TIMER_GetRadioTimerValue(&nextRadioActivity);

  /*Timer1 and wakeup timer are programmed only through the timer module*/
  if (((RADIO_TIMER_Context.radioTimer.active || RADIO_TIMER_Context.radioTimer.pending)
       && !(timerState == RADIO_TIMER1_BUSY)) || RADIO_TIMER_Context.radioTimer.intTxRx_to_be_served)
  {
    if (RADIO_TIMER_Context.radioTimer.expiryTime < (current_time + \
                                                     RADIO_TIMER_Context.last_setup_time + \
                                                     RADIO_TIMER_Context.hs_startup_time + \
                                                     LOW_POWER_THR))
    {
      return POWER_SAVE_LEVEL_CPU_HALT;
    }

    level = POWER_SAVE_LEVEL_STOP_LS_CLOCK_ON;
  }
  else
  {
    if ((timerState == RADIO_TIMER2_BUSY) || (timerState == RADIO_TIMER1_BUSY))
    {
      return POWER_SAVE_LEVEL_CPU_HALT;
    }
  }

  if (RADIO_TIMER_Context.rootNode != NULL && RADIO_TIMER_Context.rootNode->active)
  {
    if (RADIO_TIMER_Context.rootNode->expiryTime < (current_time + LOW_POWER_THR + RADIO_TIMER_Context.hs_startup_time))
    {
      return POWER_SAVE_LEVEL_CPU_HALT;
    }

    if (level == POWER_SAVE_LEVEL_STOP)
    {
      if ((RADIO_TIMER_Context.rootNode->next == NULL)
          && (RADIO_TIMER_Context.rootNode == &RADIO_TIMER_Context.calibrationTimer))
      {
        RADIO_TIMER_Context.stop_notimer_action = TRUE;
        _virtualTimeBaseEnable(DISABLE);
        LL_RADIO_TIMER_DisableCPUWakeupTimer(WAKEUP);
        return POWER_SAVE_LEVEL_STOP;
      }
    }
    level = POWER_SAVE_LEVEL_STOP_LS_CLOCK_ON;
  }

  return level;
}

/* ---------------------- RADIO Activity APIs --------------------------------*/
/**
  * @brief  Schedules a radio activity for the given absolute timeout value expressed in STU.
  *         If the calibration of the low speed oscillator is needed, if it is possible,
  *         the radio timer will be programmed with the latest calibration data.
  * @param  time: Absolute time expressed in STU.
  * @param  event_type: Specify if it is a TX (1) or RX (0) event.
  * @param  cal_req: Specify if PLL calibration is requested (1) or not (0).
  * @retval 0 if radio activity has been scheduled successfully.
  * @retval 1 if radio activity has been rejected (it is too close or in the past).
  */
uint32_t HAL_RADIO_TIMER_SetRadioTimerValue(uint32_t time, uint8_t event_type, uint8_t cal_req)
{
  uint8_t retVal = 0;
#if defined (STM32WB06) || defined (STM32WB07)
  uint64_t current_time;
#endif

  RADIO_TIMER_Context.radioTimer.event_type = event_type;
  RADIO_TIMER_Context.radioTimer.cal_req = cal_req;
  RADIO_TIMER_Context.radioTimer.expiryTime = RADIO_TIMER_Context.calibrationData.last_calibration_time + (uint32_t)(time - (uint32_t)RADIO_TIMER_Context.calibrationData.last_calibration_time);
  RADIO_TIMER_Context.radioTimer.active = FALSE;
  RADIO_TIMER_Context.radioTimer.intTxRx_to_be_served = FALSE;
  RADIO_TIMER_Context.radioTimer.pending = TRUE;

