stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio_timer.c
  return curr;
}

#if defined (STM32WB05) || defined (STM32WB09)
static uint32_t VTIMER_SetWakeupTime(uint32_t delay, bool allow_sleep)
{
  uint32_t current_time;
  delay = blue_unit_conversion(delay, RADIO_TIMER_Context.calibrationData.freq1, MULT64_THR_FREQ) ;
  /* If the delay is too small round to minimum 2 tick */
  delay = MAX(32, delay);
  current_time = LL_RADIO_TIMER_GetAbsoluteTime(WAKEUP);
  /* 4 least significant bits are not taken into account. Then let's round the value */
  LL_RADIO_TIMER_SetCPUWakeupTime(WAKEUP, ((current_time + (delay + 8)) & TIMER_MAX_VALUE));
  LL_RADIO_TIMER_EnableWakeupTimerLowPowerMode(WAKEUP);
  LL_RADIO_TIMER_EnableCPUWakeupTimer(WAKEUP);

  return current_time;
}
#endif

static VTIMER_HandleType *_insert_timer_in_queue(VTIMER_HandleType *rootNode, VTIMER_HandleType *handle)
{
  VTIMER_HandleType *current = rootNode;
  VTIMER_HandleType *prev = NULL;
  VTIMER_HandleType *returnValue = rootNode;

  while ((current != NULL) && (current->expiryTime < handle->expiryTime))
  {
    prev = current;
    current = current->next;
  }

  handle->next = current;

  if (prev == NULL)
  {
    /* We are the new root */
    returnValue = handle;
  }
  else
  {
    prev->next = handle;
  }

  return returnValue;
}

static void _virtualTimeBaseEnable(FunctionalState state)
{
  if (state != DISABLE)
  {
    if (RADIO_TIMER_Context.enableTimeBase == FALSE)
    {
      _calibration_callback(&RADIO_TIMER_Context.calibrationTimer);
      RADIO_TIMER_Context.enableTimeBase = TRUE;
    }
  }
  else
  {
    HAL_RADIO_TIMER_StopVirtualTimer(&RADIO_TIMER_Context.calibrationTimer);
    RADIO_TIMER_Context.enableTimeBase = FALSE;
  }
}

static VTIMER_HandleType *_remove_timer_in_queue(VTIMER_HandleType *rootNode, VTIMER_HandleType *handle)
{
  VTIMER_HandleType *current = rootNode;
  VTIMER_HandleType *prev = NULL;
  VTIMER_HandleType *returnValue = rootNode;

  while ((current != NULL) && (current != handle))
  {
    prev = current;
    current = current->next;
  }

  if (current == NULL)
  {
    /* Not found */
  }
  else if (current == rootNode)
  {
    /* New root node */
    returnValue = current->next;
  }
  else
  {
    prev->next = current->next;
  }

  return returnValue;
}

/* Check the number of expired timer from rootNode (ordered list of timers) and return the list of expired timers */
static VTIMER_HandleType *_check_callbacks(VTIMER_HandleType *rootNode, VTIMER_HandleType **expiredList)
{

  VTIMER_HandleType *curr = rootNode;
  VTIMER_HandleType *prev = NULL;
  VTIMER_HandleType *returnValue = rootNode;
  *expiredList = rootNode;

  int64_t delay;
  uint32_t expiredCount = 0;

  while (curr != NULL)
  {

    if (curr->active)
    {
      delay = curr->expiryTime - HAL_RADIO_TIMER_GetCurrentSysTime();

      if (delay > 5)   /*TBR*/
      {
        /* End of expired timers list*/
        break;
      }
    }

    prev = curr;
    curr = curr->next;
    expiredCount++;
  }

  if (expiredCount)
  {
    /* Some timers expired */
    prev->next = NULL;
    returnValue = curr;
  }
  else
  {
    /* No timer expired */
    *expiredList = NULL;
  }

  return returnValue;
}

static void _updateCalibrationData(void)
{
  if (RADIO_TIMER_Context.calibrationSettings.periodicCalibration)
  {

    CalibrationDataTypeDef updatedCalibrationData;
    _get_calibration_data(&updatedCalibrationData);
    _update_xtal_startup_time(RADIO_TIMER_Context.hs_startup_time, updatedCalibrationData.freq1);

    ATOMIC_SECTION_BEGIN();
    RADIO_TIMER_Context.calibrationData.calibration_data_available = 1;
    RADIO_TIMER_Context.calibrationData.freq = updatedCalibrationData.freq;
    RADIO_TIMER_Context.calibrationData.freq1 = updatedCalibrationData.freq1;
    RADIO_TIMER_Context.calibrationData.period = updatedCalibrationData.period;
    RADIO_TIMER_Context.calibrationData.period1 = updatedCalibrationData.period1;
    _update_system_time(&RADIO_TIMER_Context);
    ATOMIC_SECTION_END();

    _configureTxRxDelay(&RADIO_TIMER_Context, FALSE);
  }
  else
  {
  ATOMIC_SECTION_BEGIN();
  _update_system_time(&RADIO_TIMER_Context);
  ATOMIC_SECTION_END();
  }
}

/* This function update the system time after a calibration.
 * If the user calls too often this function, you could have rounding issues in the integer maths.
 */
static void _update_system_time(RADIO_TIMER_ContextTypeDef *context)
{
  uint32_t current_machine_time;
  uint32_t period;

  current_machine_time = LL_RADIO_TIMER_GetAbsoluteTime(WAKEUP);
  period = context->calibrationData.last_period1;
  context->cumulative_time = context->calibrationData.last_calibration_time + \
                             blue_unit_conversion(TIME_ABSDIFF(current_machine_time,
                                                               context->last_machine_time),
                                                  period, MULT64_THR_PERIOD);

  if ((context->calibrationSettings.periodicCalibration == 0)
      && (TIME_ABSDIFF(current_machine_time,
                       context->last_machine_time) < context->calibrationData.calibration_machine_interval))
  {
    context->cumulative_time += blue_unit_conversion(TIMER_MAX_VALUE, period, MULT64_THR_PERIOD);
  }
  context->last_machine_time = current_machine_time;
  context->calibrationData.last_calibration_time = context->cumulative_time;
  context->calibrationData.last_period1 = context->calibrationData.period1;
}

/* Check if it is time to program the pending radio timer (large timeouts).
   1) The radio event is before the next calibration event. Then the timer must be programmed.
   2) The calibration timer expired but the calibration didn't start and the values not updated as expected.
      Then the next calibration event is misleading. The radio timer must be programmed.
   3) The radio event is after the next calibration event. Then the timer will be programmed with the latest values.
   The check on the next calibration event is made even though the calibration is disabled (max cal. interval)
   in order to avoid counter wrapping with timeouts far in the future.
*/
static void _check_radio_activity(RADIO_TIMER_RadioHandleTypeDef *timerHandle, uint8_t *expired)
{
  uint64_t nextCalibrationEvent, currentTime;
  *expired = 0;
  if (timerHandle->pending)
  {

