stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio_timer.c
    nextCalibrationEvent = RADIO_TIMER_Context.calibrationData.last_calibration_time + \
                           RADIO_TIMER_Context.calibrationSettings.periodicCalibrationInterval;

    ATOMIC_SECTION_BEGIN();
    currentTime = HAL_RADIO_TIMER_GetCurrentSysTime();
    if ((timerHandle->expiryTime < (nextCalibrationEvent + RADIO_ACTIVITY_MARGIN)) || \
        (currentTime > (nextCalibrationEvent + CALIB_SAFE_THR)))
    {
      if (timerHandle->expiryTime - TIMER1_INIT_DELAY > (currentTime + TIMER1_MARGIN))
      {
        *expired = TIMER_SetRadioTimerValue(timerHandle->expiryTime, timerHandle->event_type, timerHandle->cal_req);
        timerHandle->pending = FALSE; /* timer has been served. No more pending */
        timerHandle->active = TRUE; /* timer has been programmed and it becomes ACTIVE */
        timerHandle->intTxRx_to_be_served = TRUE;
      }
      else
      {

        RADIO_TIMER_Context.radioTimer.pending = FALSE;
        *expired = 1;

      }
    }
    else
    {

#if defined (STM32WB06) || defined (STM32WB07)
      RADIO_TIMER_Context.waitCal = 1;
#endif

    }
    ATOMIC_SECTION_END();

  }
}

#if defined (STM32WB06) || defined (STM32WB07)
/**
  * @brief   Set the wakeup time to the specified delay. The delay is converted in machine time and only 28 most significant bits
  *          are taken into account. The XTAL startup time is not taken into account for the wakeup, i.e. the system does not wait for
  *          the XTAL startup time parameter to trigger the interrupt. If is it possible the wakeup timer is programmed too.
  *          The delay is translated into machine time unit (MTU) and it is assigned to the wakeup register.
  * @param   delay: Delay from the current time expressed in system time unit (STU). Range is 0 to maximum value of STU.
  *          The maximum value STU is dependent on the speed of the low speed oscillator.
  *          A value too small will force the timer to wrap, so it is recommended to use at least 5-10 STU.
  * @param   share: flag that indicates if the wakeup timer has to be programmed too.
  *          if other code commands the system to go to deep sleep.
  * @warning The API must be called with interrupts disabled to avoid programming the timer with a value in the past.
  * @return  Current time in MTU.
  */
static uint32_t TIMER_SetRadioHostWakeupTime(uint32_t delay, bool *share)
{
  uint32_t current_time;

  delay = blue_unit_conversion(delay, RADIO_TIMER_Context.calibrationData.freq1, MULT64_THR_FREQ) ;
  /* If the delay is too small round to minimum 2 tick */
  delay = MAX(32, delay);
  current_time = LL_RADIO_TIMER_GetAbsoluteTime(WAKEUP);
  /* 4 least significant bits are not taken into account. Then let's round the value */
  LL_RADIO_TIMER_SetCPUWakeupTime(WAKEUP, ((current_time + (delay + 8)) & TIMER_MAX_VALUE));
  LL_RADIO_TIMER_EnableWakeupTimerLowPowerMode(WAKEUP);
  LL_RADIO_TIMER_EnableCPUWakeupTimer(WAKEUP);
  if ((LL_RADIO_TIMER_IsEnabledTimer1(BLUE) || LL_RADIO_TIMER_IsEnabledTimer2(BLUE) || (*share != TRUE)))
  {
    *share = FALSE;
    return current_time;
  }
  _set_controller_as_host();
  /* 4 least significant bits are not taken into account. Then let's round the value */
  LL_RADIO_TIMER_SetBLEWakeupTime(WAKEUP, ((current_time + delay + 8) & 0xFFFFFFF0));
  LL_RADIO_TIMER_SetSleepRequestMode(WAKEUP, 0);
  LL_RADIO_TIMER_EnableBLEWakeupTimer(WAKEUP);
  LL_RADIO_TIMER_EnableWakeupTimerLowPowerMode(WAKEUP);
  return current_time;
}

static void _set_controller_as_host(void)
{
  BLUEGLOB->BYTE4 &= ~(1 << 7);
  BLUEGLOB->BYTE22 = 0x0;
  BLUEGLOB->BYTE23 = 0x0;
}

static void _check_host_activity(void)
{
  uint8_t expired;
  RADIO_TIMER_Context.rootNode = _update_user_timeout(RADIO_TIMER_Context.rootNode, &expired);
  if (expired == 1)
  {
    /* A new root timer is already expired, mimic timer expire */
    INCREMENT_EXPIRE_COUNT_ISR;
  }
}
#endif

/**
  * @brief   Programs either the Wakeup timer or Timer1. Both timers are able to trigger the radio sequencer.
  *          Then, they are able to start a transmission or a reception according to the configured radio ram tables.
  *          Only the wakeup timer is able to let the device out from sleep.
  *          The wakeup timer is programmed if the anolag part has enough time to settle after the wakeup or not.
  *          The timeout passed as parameter represents the moment where the first bit must be transmitted or the
  *          receive window must be opened.
  *          Since the radio needs some time to setup, the final timeout programmed is compensated by certain
  *          time intervals according to the kind of operation (Tx or Rx), calibration request and programmed timer.
  *          The wakeup offset is compensated automatically by the hardware.
  *          The CPU wakes up at timeout minus wakeup_offset. if the wakeup timer is programmed, the BLE event triggers
  *          when the absolute time mathches the 28 MSB of the timeout. Otherwise the trigger event occurs considering all 32 bits.
  * @param   timeout: absolute starting time of the desired operation expressed in STU.
  *                   If this absolute time is less then the current time, the timer will wrap.
  *                   The maximum value STU is dependent on the speed of the low speed oscillator.
  * @param   event_type: 1 Tx event.
                         0 Rx event
  * @param   cal_req: 1 pll calibration is requested.
                     0 pll calibration is not requested.
  * @warning The API must be called with interrupts disabled to avoid programming the timer with a value in the past
  * @retval  0 if a correct timeout has been programmed in the timeout register
  * @retval  1 if a correct timeout cannot be programmed
  */
static uint8_t TIMER_SetRadioTimerValue(uint32_t timeout, bool event_type, bool cal_req)
{
  uint32_t current_time, delay, radio_init_delay, device_delay, rel_timeout, rel_timeout_mt;
  uint8_t ret_val;

  /*choose the 2nd init duration. Check the event_type and cal. request*/
  if (event_type == TX)
  {
    if (cal_req)
    {
      radio_init_delay = RADIO_TIMER_Context.TxRxDelay.tx_cal_delay;
      device_delay = RADIO_TIMER_Context.TxRxDelay.tx_cal_delay_st;
    }
    else
    {
      radio_init_delay = RADIO_TIMER_Context.TxRxDelay.tx_no_cal_delay;
      device_delay = RADIO_TIMER_Context.TxRxDelay.tx_cal_delay_st;
    }
  }
  else
  {
    if (cal_req)
    {
      radio_init_delay = RADIO_TIMER_Context.TxRxDelay.rx_cal_delay;
      device_delay = RADIO_TIMER_Context.TxRxDelay.tx_cal_delay_st;
    }
    else
    {
      radio_init_delay = RADIO_TIMER_Context.TxRxDelay.rx_no_cal_delay;
      device_delay = RADIO_TIMER_Context.TxRxDelay.tx_cal_delay_st;
    }
  }

  /* At this point, it is care of the upper layers to guarantee that the timeout represents an absolute time in the future */
  rel_timeout = timeout - (uint32_t)_get_system_time_and_machine(&RADIO_TIMER_Context, &current_time);

  rel_timeout_mt =  blue_unit_conversion(rel_timeout, RADIO_TIMER_Context.calibrationData.freq1, MULT64_THR_FREQ);

